#pragma once
#include <stdio.h>
#include <stdlib.h>
#include "Console.h"
#include "Bullet.h"
#include "TextParser.h"
#include "MovePattern.h"
#include "CBaseObject.h"
//--------------------------------------------------------------------
//적 최대 수
//--------------------------------------------------------------------
#define MAXENEMYNUM 100

//--------------------------------------------------------------------
//적 최대 종류
//--------------------------------------------------------------------
#define MAXENEMYTYPE 100


//--------------------------------------------------------------------
// 적의 정보
// 
// 적의 모양
// 적의 시작 위치
//--------------------------------------------------------------------
class CEnemy:public CBaseObject{

public:

	CEnemy() :CBaseObject(ENEMY, 0, 0, 0) {}
	~CEnemy() {}

	bool		Update(void) override;
	void		Render(void) override;
	void		OnCollision(CBaseObject* other) override;

	//--------------------------------------------------------------------
// 자동으로 적 위치 좌표 이동
// 적 메모리 풀에 있는 적들을 이동시켜준다.
//--------------------------------------------------------------------
	void MoveEnemys(CEnemy E[]);

	//--------------------------------------------------------------------
	// 자동으로 적 위치 좌표 이동
	// 적들이 각각 패턴을 기반으로 움직이도록 해준다.
	//--------------------------------------------------------------------
	void MoveEnemy();

	//--------------------------------------------------------------------
	// 적이 총알 데미지 입음
	//--------------------------------------------------------------------
	void CheckDamagedEnemys(CBullet* bp, CEnemy* ep);


	//--------------------------------------------------------------------
	// 적이 총알 데미지 입음
	//--------------------------------------------------------------------
	void CheckDamagedEnemy(CBaseObject* other);

	//--------------------------------------------------------------------
	// 적과 총알 충돌 체크
	//--------------------------------------------------------------------
	bool CheckBulletCollision(CBullet* bp, CEnemy* ep);

	//--------------------------------------------------------------------
	// 적 총알 발사
	//--------------------------------------------------------------------
	void EnemysFire(CEnemy* ep, CBullet* bp);

	//--------------------------------------------------------------------
	// 적 총알 발사
	//--------------------------------------------------------------------
	void EnemyFire();

	//--------------------------------------------------------------------
	// 적 파일 데이터 로드
	//--------------------------------------------------------------------
	static bool LoadEnemys(CEnemy e[]);

	//--------------------------------------------------------------------
	// 적 이름으로 적 데이터 불러오기
	// 
	//--------------------------------------------------------------------
	static bool LoadEnemy(CEnemy* e, const char* filename);

	char GetShape(void) { return _shape; };
	//안 쓰고 싶었으나 스테이지 데이터에서 가져온 데이터로 세팅하기위해 사용
	void SetPos(int x, int y) { _X = x, _Y = y; };
	bool IsAvailable(void) { return _Active; };
	void Deactivate(void) { _Active = false;}

	int getexpos_X() { return _Prev_x; }
	int getexpos_Y() { return _Prev_y; }

protected:

	char _shape = 'A';
	int _Prev_x = 40;
	int _Prev_y = 3;
	int _directionX = 1;
	int _hp = 1;
	int _firePassability = 5;
	tag_Pattern _pattern = {
		"pattern",
		(-1,0),(-1,0),(-1,0),(1,0),(1,0),(1,0),(-1,0),(-1,0),(-1,0),(1,0),(1,0),(1,0),
		0,
		0
	};
};


//--------------------------------------------------------------------
//적 타입
//--------------------------------------------------------------------
extern CEnemy EnemyType[MAXENEMYTYPE];
