#pragma once
#include "Console.h"

//--------------------------------------------------------------------
//총알 최대 수
//--------------------------------------------------------------------
#define MAXBULLETNUM 100

//--------------------------------------------------------------------
// 총알의 정보
// 
// 총알의 모양
// 총알의 위치
// 총알 종류
// 총알 방향
//--------------------------------------------------------------------
struct tag_Bullet
{
	bool Active = false;

	char shape = 'O';
	int x = 0;
	int y = 0;
	bool bEnemy = false;
	int directionY = -1;
};

//--------------------------------------------------------------------
// 자동으로 총알 위치 좌표 이동
// 종류에 따라 위 or 아래로 움직임
// 플레이어는 스페이스로 총알 생성
// 적은 랜덤한 시간으로 총알 생성
//--------------------------------------------------------------------
void MoveBullet(tag_Bullet* bp);

//--------------------------------------------------------------------
// 총알 메모리 풀에서 사용가능한 총알 반환
//--------------------------------------------------------------------
tag_Bullet* FindBullet(tag_Bullet* bp);