#pragma once
#include "Console.h"
#include "TextParser.h"
#include "CBaseObject.h"

//--------------------------------------------------------------------
//총알 최대 수
//--------------------------------------------------------------------
#define MAXBULLETNUM 100
//--------------------------------------------------------------------
//총알 타입 수
//--------------------------------------------------------------------
#define MAXBULLETTYPE 1


//--------------------------------------------------------------------
// 총알의 정보
// 
// 총알의 모양
// 총알의 위치
// 총알 종류
// 총알 방향
//--------------------------------------------------------------------
class CBullet : public CBaseObject {
public:
	CBullet() :CBaseObject(_ObjectType, _X, _Y) {};
	~CBullet() {};

	virtual bool		Update(void) override;
	virtual void		Render(void) override;
	virtual void		OnCollision(CBaseObject* other) override;

//--------------------------------------------------------------------
// 자동으로 총알 위치 좌표 이동
// 종류에 따라 위 or 아래로 움직임
// 플레이어는 스페이스로 총알 생성
// 적은 랜덤한 시간으로 총알 생성
//--------------------------------------------------------------------
	void MoveBullet(CBullet* bp);

	//--------------------------------------------------------------------
	// 총알 메모리 풀에서 사용가능한 총알 반환
	//--------------------------------------------------------------------
	CBullet* FindBullet(CBullet* bp);


	//--------------------------------------------------------------------
	// 총알 모양 파일에서 읽어서 메모리 풀 초기화
	//--------------------------------------------------------------------
	bool loadBullet(CBullet b[]);

	//-------------------------------------------------------------------
	// 총알을 적이나 플레이어 것으로 세팅해줄 함수
	//-------------------------------------------------------------------
	void InitBullet(bool bE, int x, int y, int direction);

	//-------------------------------------------------------------------
	// 총알 메모리 풀에서 _Active를 확인하기 위한 함수
	//-------------------------------------------------------------------
	bool IsAvailable(void);

	//-------------------------------------------------------------------
	// 총알 메모리 풀에 있는 총알 활성화, _Active를 true로 만들자
	//-------------------------------------------------------------------
	void Activate(void);

	//-------------------------------------------------------------------
	// 총알 메모리 풀에서 _Active를 확인하기 위한 함수
	//-------------------------------------------------------------------
	void Deactivate(void);

protected:
	int _ObjectType = 2;
	int _X = 0;
	int _Y = 0;

	char _type[12] = "none";

	bool _Active = false;

	char _shape = 'O';
	char _pshape = 'O';
	char _eshape = 'O';
	bool _bEnemy = false;
	int _directionY = -1;
};

//--------------------------------------------------------------------
//총알 타입
//--------------------------------------------------------------------
extern CBullet BulletType[MAXBULLETTYPE];