#pragma once

//struct tag_Player
//{
//	char shape = '@';
//	int x = 0;
//	int y = 0;
//	int hp = 0;
//	bool Active = 0;
//};

//struct tag_Bullet
//{
//	char type[12] = "none";
//
//	bool Active = false;
//
//	char shape = 'O';
//	char pshape = 'O';
//	char eshape = 'O';
//	int x = 0;
//	int y = 0;
//	bool bEnemy = false;
//	int directionY = -1;
//};

//struct tag_Enemy
//{
//	char shape = '@';
//	int Cur_x = 0;
//	int Cur_y = 0;
//	int Prev_x = 0;
//	int Prev_y = 0;
//	int directionX = 0;
//	int hp = 0;
//	int firePassability = 0;
//	bool Active = 0;
//	tag_Pattern pattern;
//};



//class BaseObject {
//	char shape = '@';
//	int x = 0;
//	int y = 0;
//	bool Active = 0;
//};

class CBaseObject
{
public:

	CBaseObject(int ObjectType, int X, int Y);
	virtual ~CBaseObject();

	virtual bool		Update(void) = 0;
	virtual void		Render(void) = 0;
	virtual void		OnCollision(CBaseObject* other) = 0;

	int	 GetObjectType();

protected:

	int 	_iX;
	int 	_iY;
	int 	_ObjectType;
};


////--------------------------------------------------------------------
//// 자동으로 적 위치 좌표 이동
//// 적 메모리 풀에 있는 적들을 이동시켜준다.
////--------------------------------------------------------------------
//void MoveEnemys(tag_Enemy E[]);
//
////--------------------------------------------------------------------
//// 자동으로 적 위치 좌표 이동
//// 적들이 각각 패턴을 기반으로 움직이도록 해준다.
////--------------------------------------------------------------------
//void MoveEnemy(tag_Enemy* E);
//
////--------------------------------------------------------------------
//// 적이 총알 데미지 입음
////--------------------------------------------------------------------
//void CheckDamagedEnemy(tag_Bullet* bp, tag_Enemy* ep);
//
////--------------------------------------------------------------------
//// 적과 총알 충돌 체크
////--------------------------------------------------------------------
//bool CheckBulletCollision(tag_Bullet* bp, tag_Enemy* ep);
//
////--------------------------------------------------------------------
//// 적 총알 발사
////--------------------------------------------------------------------
//void EnemyFire(tag_Enemy* ep, tag_Bullet* bp);
//
////--------------------------------------------------------------------
//// 적 파일 데이터 로드
////--------------------------------------------------------------------
//bool LoadEnemys(tag_Enemy e[]);
//
////--------------------------------------------------------------------
//// 적 이름으로 적 데이터 불러오기
//// 
////--------------------------------------------------------------------
//bool LoadEnemy(tag_Enemy* e, const char* filename);

////--------------------------------------------------------------------
//// 키 입력에 따라 플레이어의 위치 좌표 이동
////--------------------------------------------------------------------
//void MovePlayer(tag_Player* p, tag_Bullet* bp);
//
////--------------------------------------------------------------------
//// 플레이어와 총알 충돌 체크
////--------------------------------------------------------------------
//void CheckPlayerHit(tag_Bullet* bp, tag_Player* p);
//
////--------------------------------------------------------------------
//// 플레이어 총알 발사
////--------------------------------------------------------------------
//void PlayerFire(tag_Player* p, tag_Bullet* bp);
//
////--------------------------------------------------------------------
//// 플레이어 파일 데이터 로드
////--------------------------------------------------------------------
//bool LoadPlayer(tag_Player* p);
//
////--------------------------------------------------------------------
//// 플레이어 사망 체크
////--------------------------------------------------------------------
//bool CkeckGameOver(tag_Player* p);