#pragma once
#include <stdio.h>
#include <stdlib.h>
#include "Console.h"
#include "Bullet.h"
#include "TextParser.h"
#include "MovePattern.h"
#include "CBaseObject.h"
//--------------------------------------------------------------------
//적 최대 수
//--------------------------------------------------------------------
#define MAXENEMYNUM 100

//--------------------------------------------------------------------
//적 최대 종류
//--------------------------------------------------------------------
#define MAXENEMYTYPE 100


//--------------------------------------------------------------------
// 적의 정보
// 
// 적의 모양
// 적의 시작 위치
//--------------------------------------------------------------------
class CEnemy:public CBaseObject{

public:

	CEnemy() :CBaseObject(_ObjectType, _X, _Y) {}
	~CEnemy() {}

	bool		Update(void) override;
	void		Render(void) override;
	void		OnCollision(CBaseObject* other) override;

	//--------------------------------------------------------------------
// 자동으로 적 위치 좌표 이동
// 적 메모리 풀에 있는 적들을 이동시켜준다.
//--------------------------------------------------------------------
	void MoveEnemys(CEnemy E[]);

	//--------------------------------------------------------------------
	// 자동으로 적 위치 좌표 이동
	// 적들이 각각 패턴을 기반으로 움직이도록 해준다.
	//--------------------------------------------------------------------
	void MoveEnemy(CEnemy* E);

	//--------------------------------------------------------------------
	// 적이 총알 데미지 입음
	//--------------------------------------------------------------------
	void CheckDamagedEnemy(CBullet* bp, CEnemy* ep);

	//--------------------------------------------------------------------
	// 적과 총알 충돌 체크
	//--------------------------------------------------------------------
	bool CheckBulletCollision(CBullet* bp, CEnemy* ep);

	//--------------------------------------------------------------------
	// 적 총알 발사
	//--------------------------------------------------------------------
	void EnemyFire(CEnemy* ep, CBullet* bp);

	//--------------------------------------------------------------------
	// 적 파일 데이터 로드
	//--------------------------------------------------------------------
	bool LoadEnemys(CEnemy e[]);

	//--------------------------------------------------------------------
	// 적 이름으로 적 데이터 불러오기
	// 
	//--------------------------------------------------------------------
	bool LoadEnemy(CEnemy* e, const char* filename);

protected:
	int 	_X = 0;
	int 	_Y = 0;
	int 	_ObjectType = 1;

	char _shape = '@';
	int _Prev_x = 0;
	int _Prev_y = 0;
	int _directionX = 0;
	int _hp = 0;
	int _firePassability = 0;
	bool _Active = 0;
	tag_Pattern _pattern;
};


//--------------------------------------------------------------------
//적 타입
//--------------------------------------------------------------------
extern CEnemy EnemyType[MAXENEMYTYPE];
