#pragma once
#include "stdafx.h"

//---------------------------------------------------------------------------------------------
// 프로젝트명: 
// 패킷 포인터 단위로 저장할 링버퍼
// 
// 목적:
// WsaSend의 인자인 wsabuf 객체 안에 송신할 패킷 단위로 넣고, 개수를 나열하기 위함
// 
// 방법 : 
// 패킷 포인터 단위로 데이터 개수를 계산하고, 담을 링버퍼를 만든다.
// 
// 결론 :
// 일단 송신 링버퍼만 해당 객체로 만들고, 수신 링버퍼는 기존의 링버퍼를 사용한다.
//---------------------------------------------------------------------------------------------

//송수신 큐 클래스 필요 함수

//생성자.
class CPacket;

class CPacketRingBuffer {
public:
	CPacketRingBuffer(void);
	CPacketRingBuffer(int iBufferSize);

	~CPacketRingBuffer();

	int GetBufferSize(void);

	/////////////////////////////////////////////////////////////////////////
	// WritePos 에 데이터 넣음.
	//
	// Return: (int)넣은 크기.
	/////////////////////////////////////////////////////////////////////////
	bool Enqueue(CPacket* cpacket);

	/////////////////////////////////////////////////////////////////////////
	// ReadPos 에서 데이타 가져옴. ReadPos 이동.
	//
	// Return: (int)가져온 크기.
	/////////////////////////////////////////////////////////////////////////
	bool Dequeue(CPacket *& pPacket);

	/////////////////////////////////////////////////////////////////////////
	// 버퍼의 모든 데이타 삭제.
	//
	// Parameters: 없음.
	// Return: 없음.
	/////////////////////////////////////////////////////////////////////////
	void ClearBuffer(void);

	/////////////////////////////////////////////////////////////////////////
	// 원하는 길이만큼 읽기위치 에서 삭제 / 쓰기 위치 이동
	//
	// Parameters: 없음.
	// Return: (int)이동크기
	/////////////////////////////////////////////////////////////////////////
	int	 MoveRear(int iSize);
	int	 MoveFront(int iSize);

	/////////////////////////////////////////////////////////////////////////
	// 버퍼의 Front 포인터 얻음.
	//
	// Parameters: 없음.
	// Return: (char *) 버퍼 포인터.
	/////////////////////////////////////////////////////////////////////////
	CPacket** GetFrontBufferPtr(void);


	/////////////////////////////////////////////////////////////////////////
	// 버퍼의 RearPos 포인터 얻음.
	//
	// Parameters: 없음.
	// Return: (char *) 버퍼 포인터.
	/////////////////////////////////////////////////////////////////////////
	CPacket** GetRearBufferPtr(void);

	//--------------------------------------------------------
	// Front가 아닌 버퍼 시작부를 가져오기 위한 함수
	//--------------------------------------------------------
	CPacket** GetBufPtr(void);

	//----------------------------------
	// 아래 두 개는 private으로 가는게 적절해보임.
	// 어차피 스레드 차원에서 읽어봤자 의미없고, deq,enq 실패하더라도 락걸고 대기하기때문에 괜찮음.
	// ---------------------------------
	/////////////////////////////////////////////////////////////////////////
	// 현재 사용중인 용량 얻기.
	//
	// Parameters: 없음.
	// Return: (int)사용중인 용량.
	/////////////////////////////////////////////////////////////////////////
	int GetUseSize(void);

	/////////////////////////////////////////////////////////////////////////
	// 현재 버퍼에 남은 용량 얻기. 
	//
	// Parameters: 없음.
	// Return: (int)남은용량.
	/////////////////////////////////////////////////////////////////////////
	int GetFreeSize(void);

	//----------------------------------------------------------------
	// wsabuf에 값을 세팅해주기 위해 front 값을 넘겨준다.
	//----------------------------------------------------------------
	int GetFront() {
		long l = 0;
		InterlockedExchange(&l,0);
		return _front;
	}

private:
	//Get 함수는 락 걸 필요없음. 어차피 원하는 동기화를 얻을 수 없음.
	//A스레드 Get 해서 개수 얻은 후, B 스레드가 Enqueue나 Dequeue하면 어차피 수는 틀어짐.
	//Get해 간 후 아래 로직에서 알아서 걸러지도록 해야함 -> enq,deq에 락 건다.
	CRITICAL_SECTION _csRingbuffer;
	CPacket** _packetBuffer;
	int _capacity;
	int _front;
	int _rear;
	bool _IsFull;

//void	Resize(int size);

/////////////////////////////////////////////////////////////////////////
// ReadPos 에서 데이타 읽어옴. ReadPos 고정.
// 송신 링버퍼에서 필요없는 내용
// Return: (int)가져온 크기.
/////////////////////////////////////////////////////////////////////////
//int Peek(char* chpDest, int iSize);

	/////////////////////////////////////////////////////////////////////////
// 버퍼 포인터로 외부에서 한방에 읽고, 쓸 수 있는 길이.
// (끊기지 않은 길이)
//
// 원형 큐의 구조상 버퍼의 끝단에 있는 데이터는 끝 -> 처음으로 돌아가서
// 2번에 데이터를 얻거나 넣을 수 있음. 이 부분에서 끊어지지 않은 길이를 의미
//
// Parameters: 없음.
// Return: (int)사용가능 용량.
////////////////////////////////////////////////////////////////////////
//int DirectEnqueueSize(void);
//int	 DirectDequeueSize(void);
};





