#pragma once
#include "stdafx.h"

//---------------------------------------------------------------------------------------------
// 프로젝트명: 
// 패킷 포인터 단위로 저장할 링버퍼
// 
// 목적:
// WsaSend의 인자인 wsabuf 객체 안에 송신할 패킷 단위로 넣고, 개수를 나열하기 위함
// 
// 방법 : 
// 패킷 포인터 단위로 데이터 개수를 계산하고, 담을 링버퍼를 만든다.
// 
// 결론 :
// 일단 송신 링버퍼만 해당 객체로 만들고, 수신 링버퍼는 기존의 링버퍼를 사용한다.
//---------------------------------------------------------------------------------------------

//송수신 큐 클래스 필요 함수

//생성자.

class CRingBuffer {
public:
	CRingBuffer(void);
	CRingBuffer(int iBufferSize);

	~CRingBuffer();

	void	Resize(int size);

	int GetBufferSize(void);

	/////////////////////////////////////////////////////////////////////////
	// 현재 사용중인 용량 얻기.
	//
	// Parameters: 없음.
	// Return: (int)사용중인 용량.
	/////////////////////////////////////////////////////////////////////////
	int GetUseSize(void);

	/////////////////////////////////////////////////////////////////////////
	// 현재 버퍼에 남은 용량 얻기. 
	//
	// Parameters: 없음.
	// Return: (int)남은용량.
	/////////////////////////////////////////////////////////////////////////
	int GetFreeSize(void);



	/////////////////////////////////////////////////////////////////////////
	// WritePos 에 데이터 넣음.
	//
	// Parameters: (char *)데이타 포인터. (int)크기. 
	// Return: (int)넣은 크기.
	/////////////////////////////////////////////////////////////////////////
	int Enqueue(const char* chpData, int iSize);

	/////////////////////////////////////////////////////////////////////////
	// ReadPos 에서 데이타 가져옴. ReadPos 이동.
	//
	// Parameters: (char *)데이타 포인터. (int)크기.
	// Return: (int)가져온 크기.
	/////////////////////////////////////////////////////////////////////////
	int Dequeue(char* chpDest, int iSize);

	/////////////////////////////////////////////////////////////////////////
	// ReadPos 에서 데이타 읽어옴. ReadPos 고정.
	//
	// Parameters: (char *)데이타 포인터. (int)크기.
	// Return: (int)가져온 크기.
	/////////////////////////////////////////////////////////////////////////
	int Peek(char* chpDest, int iSize);


	/////////////////////////////////////////////////////////////////////////
	// 버퍼의 모든 데이타 삭제.
	//
	// Parameters: 없음.
	// Return: 없음.
	/////////////////////////////////////////////////////////////////////////
	void ClearBuffer(void);








	/////////////////////////////////////////////////////////////////////////
	// 버퍼 포인터로 외부에서 한방에 읽고, 쓸 수 있는 길이.
	// (끊기지 않은 길이)
	//
	// 원형 큐의 구조상 버퍼의 끝단에 있는 데이터는 끝 -> 처음으로 돌아가서
	// 2번에 데이터를 얻거나 넣을 수 있음. 이 부분에서 끊어지지 않은 길이를 의미
	//
	// Parameters: 없음.
	// Return: (int)사용가능 용량.
	////////////////////////////////////////////////////////////////////////
	int DirectEnqueueSize(void);
	int	 DirectDequeueSize(void);

	/////////////////////////////////////////////////////////////////////////
	// 원하는 길이만큼 읽기위치 에서 삭제 / 쓰기 위치 이동
	//
	// Parameters: 없음.
	// Return: (int)이동크기
	/////////////////////////////////////////////////////////////////////////
	int	 MoveRear(int iSize);
	int	 MoveFront(int iSize);



	/////////////////////////////////////////////////////////////////////////
	// 버퍼의 Front 포인터 얻음.
	//
	// Parameters: 없음.
	// Return: (char *) 버퍼 포인터.
	/////////////////////////////////////////////////////////////////////////
	char* GetFrontBufferPtr(void);


	/////////////////////////////////////////////////////////////////////////
	// 버퍼의 RearPos 포인터 얻음.
	//
	// Parameters: 없음.
	// Return: (char *) 버퍼 포인터.
	/////////////////////////////////////////////////////////////////////////
	char* GetRearBufferPtr(void);

	//--------------------------------------------------------
	// Front가 아닌 버퍼 시작부를 가져오기 위한 함수
	//--------------------------------------------------------
	char* GetBufPtr(void);

	//----------------------------------------------------
	// 멀티 스레드에서 링버퍼의 락을 보장받기 위한 락과 언락
	//----------------------------------------------------
	void GetLockBuffer();
	void UnLockBuffer();

private:
	CRITICAL_SECTION m_csRingbuffer;
	char* m_pBuffer;
	int m_iBufferSize;
	int m_iFront;
	int m_iRear;
	bool m_bIsFull;
};





