#include <Windows.h>

//--------------------------------------------------------------------------------------------
// DB 저장 메시지의 헤더
//--------------------------------------------------------------------------------------------
struct st_DBQUERY_HEADER
{
	WORD	Type;
};


// 메시지 구조체 샘플

//--------------------------------------------------------------------------------------------
//  플레이어 레벨업
//--------------------------------------------------------------------------------------------
#define df_DBQUERY_MSG_LEVELUP			0
struct st_DBQUERY_MSG_LEVELUP
{
	__int64	AccountNo;
	int	 Level;

};

//--------------------------------------------------------------------------------------------
//  플레이어 돈 증가
//--------------------------------------------------------------------------------------------
#define df_DBQUERY_MSG_MONEY_ADD		1
struct st_DBQUERY_MSG_MONEY_ADD
{
	__int64	iAccountNo;
	int	 iMoney;
	int	 iWhy;		// 사유
};

//--------------------------------------------------------------------------------------------
//  퀘스트 완료
//--------------------------------------------------------------------------------------------
#define df_DBQUERY_MSG_QUEST_COMPLETE		2
struct st_DBQUERY_MSG_QUEST_COMPLETE
{
	__int64	iAccountNo;
	int	 iQuestID;
};

//--------------------------------------------------------------------------------------------
//  아이템 구매
//--------------------------------------------------------------------------------------------
#define df_DBQUERY_MSG_ITEM_BUY			3
struct st_DBQUERY_MSG_ITEM_BUY
{
	__int64	iAccountNo;
	int 	iItemID;
	int	 iPrice;		// 만약 가격이 DB 에 정해져 있다면 넣지 않을 수도 있음
	int	 iSlot;

	// 아이템마다 능력치가 고정으로 정해져 있다면 ItemID 만으로 해결 되겠으나
	// 아이템마다 개별적인 추가 능력치가 생성되는 개념의 컨텐츠라면
	// 이에대한 능력치들이 모두 전달 되어야만 한다.
};

//--------------------------------------------------------------------------------------------
// 거래
//--------------------------------------------------------------------------------------------
#define df_DBQUERY_MSG_ITEM_TRADE			4
struct st_DBQUERY_MSG_ITEM_TRADE
{
	__int64	FromAccountNo;
	__int64	FromItemSlot;

	__int64	ToAccountNo;
	__int64	ToItemSlot;

	int 	tradeMoney;
	int	 Quantity;

	// 이처럼 인벤토리의 슬롯위치만 전달하여 거래를 성사 시킬 수도 있으며
	// 아이템의 고유 ID 를 가지고 처리 하는것도 가능

};